//===================================================
//
//授業[main.cpp]
//Author:KishimotoEiji
//
//===================================================

//*************************************
//インクルード
//*************************************
#include "main.h"
#include "process.h"

#include <stdio.h>

//===================================================
//メイン関数
//===================================================
void main(void)
{
	CProcess process;	//処理系の情報

	//モード選択
	process.SelectMode();

	//終了メッセージ
	printf("\n プログラムを終了します。お疲れ様でした。");

	//Enter入力待ち
	process.PressEnter();
}